package calendar

import (
	"fmt"

	"github.com/mooncaker816/learnmeeus/v3/julian"
)

func ExampleGenDay() {
	ly := GenLunarYear(1987)
	jd := make([]float64, 19)
	jd[0] = julian.CalendarGregorianToJD(1986, 12, 30.0)                //冬月廿九
	jd[1] = julian.CalendarGregorianToJD(1986, 12, 31+float64(2)/24)    //腊月初一
	jd[2] = julian.CalendarGregorianToJD(1987, 1, 1+float64(4)/24)      //腊月初二
	jd[3] = julian.CalendarGregorianToJD(1987, 1, 5+float64(6)/24)      //腊月初六，大雪节气月末
	jd[4] = julian.CalendarGregorianToJD(1987, 1, 6+float64(8)/24)      //腊月初七，小寒，节气月初
	jd[5] = julian.CalendarGregorianToJD(1987, 1, 28+float64(10)/24)    //腊月廿九
	jd[6] = julian.CalendarGregorianToJD(1987, 1, 29+float64(12)/24)    //正月初一
	jd[7] = julian.CalendarGregorianToJD(1987, 2, 3+float64(14)/24)     //正月初六，小寒，节气月末
	jd[8] = julian.CalendarGregorianToJD(1987, 2, 4+float64(16)/24)     //正月初七，立春，节气月初
	jd[9] = julian.CalendarGregorianToJD(1987, 6, 5+float64(18)/24)     //五月初十，节气月末
	jd[10] = julian.CalendarGregorianToJD(1987, 6, 6+float64(20)/24)    //五月十一，芒种，节气月初
	jd[11] = julian.CalendarGregorianToJD(1987, 6, 25+float64(22)/24)   //五月三十
	jd[12] = julian.CalendarGregorianToJD(1987, 6, 26+float64(22.9)/24) //六月初一
	jd[13] = julian.CalendarGregorianToJD(1987, 7, 6+float64(23)/24)    //六月十一，芒种，节气月末
	jd[14] = julian.CalendarGregorianToJD(1987, 7, 7+float64(23.1)/24)  //六月十二，小暑，节气月初
	jd[15] = julian.CalendarGregorianToJD(1987, 7, 25+float64(3)/24)    //六月三十
	jd[16] = julian.CalendarGregorianToJD(1987, 7, 26+float64(5)/24)    //闰六月初一
	jd[17] = julian.CalendarGregorianToJD(1987, 8, 7+float64(7)/24)     //闰六月十三，小暑，节气月末
	jd[18] = julian.CalendarGregorianToJD(1987, 8, 8+float64(9)/24)     //闰六月十四，立秋，节气月初
	for i, v := range jd {
		fmt.Println(i)
		fmt.Println(genDay(v, ly))
		fmt.Println("=================================")
	}
	// Output:
	// 0
	// 农历【虎】冬月（小）廿九
	// 丙寅年 庚子月 戊申日
	// 四柱：丙寅 庚子 戊申 壬子
	// =================================
	// 1
	// 农历【虎】腊月（小）初一
	// 丙寅年 辛丑月 己酉日
	// 四柱：丙寅 庚子 己酉 乙丑
	// =================================
	// 2
	// 农历【虎】腊月（小）初二
	// 丙寅年 辛丑月 庚戌日
	// 四柱：丙寅 庚子 庚戌 戊寅
	// =================================
	// 3
	// 农历【虎】腊月（小）初六
	// 丙寅年 辛丑月 甲寅日
	// 四柱：丙寅 庚子 甲寅 丁卯
	// =================================
	// 4
	// 农历【虎】腊月（小）初七
	// 丙寅年 辛丑月 乙卯日
	// 四柱：丙寅 辛丑 乙卯 庚辰
	// =================================
	// 5
	// 农历【虎】腊月（小）廿九
	// 丙寅年 辛丑月 丁丑日
	// 四柱：丙寅 辛丑 丁丑 乙巳
	// =================================
	// 6
	// 农历【兔】正月（大）初一
	// 丁卯年 壬寅月 戊寅日
	// 四柱：丙寅 辛丑 戊寅 戊午
	// =================================
	// 7
	// 农历【兔】正月（大）初六
	// 丁卯年 壬寅月 癸未日
	// 四柱：丙寅 辛丑 癸未 己未
	// =================================
	// 8
	// 农历【兔】正月（大）初七
	// 丁卯年 壬寅月 甲申日
	// 四柱：丁卯 壬寅 甲申 壬申
	// =================================
	// 9
	// 农历【兔】五月（大）初十
	// 丁卯年 丙午月 乙酉日
	// 四柱：丁卯 乙巳 乙酉 乙酉
	// =================================
	// 10
	// 农历【兔】五月（大）十一
	// 丁卯年 丙午月 丙戌日
	// 四柱：丁卯 丙午 丙戌 戊戌
	// =================================
	// 11
	// 农历【兔】五月（大）三十
	// 丁卯年 丙午月 乙巳日
	// 四柱：丁卯 丙午 乙巳 丁亥
	// =================================
	// 12
	// 农历【兔】六月（大）初一
	// 丁卯年 丁未月 丙午日
	// 四柱：丁卯 丙午 丙午 己亥
	// =================================
	// 13
	// 农历【兔】六月（大）十一
	// 丁卯年 丁未月 丙辰日
	// 四柱：丁卯 丙午 丙辰 戊子
	// =================================
	// 14
	// 农历【兔】六月（大）十二
	// 丁卯年 丁未月 丁巳日
	// 四柱：丁卯 丁未 丁巳 庚子
	// =================================
	// 15
	// 农历【兔】六月（大）三十
	// 丁卯年 丁未月 乙亥日
	// 四柱：丁卯 丁未 乙亥 戊寅
	// =================================
	// 16
	// 农历【兔】闰六月（小）初一
	// 丁卯年 丁未月 丙子日
	// 四柱：丁卯 丁未 丙子 辛卯
	// =================================
	// 17
	// 农历【兔】闰六月（小）十三
	// 丁卯年 丁未月 戊子日
	// 四柱：丁卯 丁未 戊子 丙辰
	// =================================
	// 18
	// 农历【兔】闰六月（小）十四
	// 丁卯年 丁未月 己丑日
	// 四柱：丁卯 戊申 己丑 己巳
	// =================================
}
