package calendar

import (
	"math"
	"strings"
)

//=================================岁差计算=========================================
//==================================================================================
//IAU1976岁差表
var preceTab_IAU1976 = []float64{
	0, 5038.7784, -1.07259, -0.001147, //fi
	84381.448, 0, +0.05127, -0.007726, //w
	0, +4.1976, +0.19447, -0.000179, //P
	0, -46.8150, +0.05059, +0.000344, //Q
	84381.448, -46.8150, -0.00059, +0.001813, //E
	0, +10.5526, -2.38064, -0.001125, //x
	0, 47.0028, -0.03301, +0.000057, //pi(自导出),根据P=sin(pi)*sin(II)
	629554.886, -869.8192, +0.03666, -0.001504, //II(自导出),根据Q=sin(pi)*cos(II)
	0, 5029.0966, +1.11113, +0.000006, //p
	0, 2004.3109, -0.42665, -0.041833, //th
	0, 2306.2181, +0.30188, +0.017998, //Z
	0, 2306.2181, +1.09468, +0.018203, //z
}

//IAU2000岁差表
var preceTab_IAU2000 = []float64{
	0, 5038.478750, -1.07259, -0.001147, 0, 0, //fi
	84381.448, -0.025240, +0.05127, -0.007726, 0, 0, //w,
	0, +4.1976, +0.19447, -0.000179, 0, 0, //P,
	0, -46.8150, +0.05059, +0.000344, 0, 0, //Q,
	84381.448, -46.84024, -0.00059, +0.001813, 0, 0, //E,
	0, +10.5526, -2.38064, -0.001125, 0, 0, //x
	0, 47.0028, -0.03301, +0.000057, 0, 0, //pi(自导出)
	629554.886, -869.8192, +0.03666, -0.001504, 0, 0, //II(自导出)
	0, 5028.79695, +1.11113, +0.000006, 0, 0, //p
	0, 2004.1917476, -0.4269353, -0.0418251, -0.0000601, -0.0000001, //th
	+2.5976176, 2306.0809506, +0.3019015, +0.0179663, -0.0000327, -0.0000002, //Z
	-2.5976176, 2306.0803226, +1.0947790, +0.0182273, +0.0000470, -0.0000003, //z
}

var preceTab_P03 = []float64{
	0, 5038.481507, -1.0790069, -0.00114045, +0.000132851, -9.51e-8, //fi
	84381.406000, -0.025754, +0.0512623, -0.00772503, -4.67e-7, +3.337e-7, //w
	0, 4.199094, +0.1939873, -0.00022466, -9.12e-7, +1.20e-8, //P
	0, -46.811015, +0.0510283, +0.00052413, -6.46e-7, -1.72e-8, //Q
	84381.406000, -46.836769, -0.0001831, +0.00200340, -5.76e-7, -4.34e-8, //E
	0, 10.556403, -2.3814292, -0.00121197, +0.000170663, -5.60e-8, //x
	0, 46.998973, -0.0334926, -0.00012559, +1.13e-7, -2.2e-9, //pi
	629546.7936, -867.95758, +0.157992, -0.0005371, -0.00004797, +7.2e-8, //II
	0, 5028.796195, +1.1054348, +0.00007964, -0.000023857, +3.83e-8, //p
	0, 2004.191903, -0.4294934, -0.04182264, -7.089e-6, -1.274e-7, //th
	2.650545, 2306.083227, +0.2988499, +0.01801828, -5.971e-6, -3.173e-7, //Z
	-2.650545, 2306.077181, +1.0927348, +0.01826837, -0.000028596, -2.904e-7, //z
}

//t是儒略世纪数,sc是岁差量名称,mx是模型
func prece(t float64, sc, mx string) float64 {
	var tn float64 = 1
	var c float64
	n := 0
	var p []float64
	if mx == "IAU1976" {
		n = 4
		p = preceTab_IAU1976
	}
	if mx == "IAU2000" {
		n = 6
		p = preceTab_IAU2000
	}
	if mx == "P03" {
		n = 6
		p = preceTab_P03
	}
	str := "fi w  P  Q  E  x  pi II p  th Z  z "
	ix := strings.Index(str, sc+" ") / 3
	for i := 0; i < n; i++ {
		c += p[ix*n+i] * tn
		tn *= t
	}
	return c / rad
}

//返回P03黄赤交角,t是世纪数
func hcjj(t float64) float64 {
	t2 := t * t
	t3 := t2 * t
	t4 := t3 * t
	t5 := t4 * t
	return (84381.4060 - 46.836769*t - 0.0001831*t2 + 0.00200340*t3 - 5.76e-7*t4 - 4.34e-8*t5) / rad
}

//=================================岁差旋转=========================================
//==================================================================================
//J2000赤道转Date赤道
func CDllr_J2D(t float64, llr JW, mx string) JW {
	var Z = prece(t, "Z", mx) + llr.j
	var z = prece(t, "z", mx)
	var th = prece(t, "th", mx)
	cosW, cosH := math.Cos(llr.w), math.Cos(th)
	sinW, sinH := math.Sin(llr.w), math.Sin(th)
	A := cosW * math.Sin(Z)
	B := cosH*cosW*math.Cos(Z) - sinH*sinW
	C := sinH*cosW*math.Cos(Z) + cosH*sinW
	return JW{j: rad2mrad(math.Atan2(A, B) + z), w: math.Asin(C), r: llr.r}
}

//Date赤道转J2000赤道
func CDllr_D2J(t float64, llr JW, mx string) JW {
	var Z = -prece(t, "z", mx) + llr.j
	var z = -prece(t, "Z", mx)
	var th = -prece(t, "th", mx)
	cosW, cosH := math.Cos(llr.w), math.Cos(th)
	sinW, sinH := math.Sin(llr.w), math.Sin(th)
	A := cosW * math.Sin(Z)
	B := cosH*cosW*math.Cos(Z) - sinH*sinW
	C := sinH*cosW*math.Cos(Z) + cosH*sinW
	return JW{j: rad2mrad(math.Atan2(A, B) + z), w: math.Asin(C), r: llr.r}
}

//黄道球面坐标_J2000转Date分点,t为儒略世纪数
func HDllr_J2D(t float64, llr JW, mx string) JW {
	//J2000黄道旋转到Date黄道(球面对球面),也可直接由利用球面旋转函数计算,但交角接近为0时精度很低
	jw := llr
	jw.j += prece(t, "fi", mx)
	jw = llrConv(jw, prece(t, "w", mx))
	jw.j -= prece(t, "x", mx)
	jw = llrConv(jw, -prece(t, "E", mx))
	return jw
}

//黄道球面坐标_Date分点转J2000,t为儒略世纪数
func HDllr_D2J(t float64, llr JW, mx string) JW {
	jw := llr
	jw = llrConv(jw, prece(t, "E", mx))
	jw.j += prece(t, "x", mx)
	jw = llrConv(jw, -prece(t, "w", mx))
	jw.j -= prece(t, "fi", mx)
	jw.j = rad2mrad(jw.j)
	return jw
}
